Revit 2027 API
BRepBuilder.IsValidPersistentIdsMap Method
 A validator function that makes sure that all BRepBuilderGeometryIds in the input map can be found in this BRepBuilder object.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsValidPersistentIdsMap(
	BRepBuilderPersistentIds brepPersistentIds
)
Public Function IsValidPersistentIdsMap (
	brepPersistentIds As BRepBuilderPersistentIds
) As Boolean
public:
bool IsValidPersistentIdsMap(
	BRepBuilderPersistentIds^ brepPersistentIds
)
member IsValidPersistentIdsMap :
        brepPersistentIds : BRepBuilderPersistentIds -> bool
Parameters
brepPersistentIds BRepBuilderPersistentIds
 The map that associates ExternalGeometryIds to BRepBuilderGeometryIds.
Return Value
Boolean
 True if all BRepBuilderGeometryIds in the input map can be found in this BRepBuilder object, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
BRepBuilder Class
Autodesk.Revit.DB Namespace